In [1]:
import os
print(os.getcwd())

c:\Users\jenny\venvs\py39\PYnative

In [5]:
os.chdir('C:\\Users\\jenny\\venvs\\py39\\Lib\\site-packages')
import pandas as pd
import matplotlib.pyplot as pyplot
%matplotlib inline
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv', header = 3)
pd.options.display.max_rows = 20

In [6]:
oo.tail() # oo.tail(5) also works

     2 alfa-romero hatchback   94.5  171.2 ohcv   six  154  19    16500
53  81  volkswagen     sedan   97.3  171.7  ohc  four   85  27   7975.0
54  82  volkswagen     sedan   97.3  171.7  ohc  four   52  37   7995.0
55  86  volkswagen     sedan   97.3  171.7  ohc  four  100  26   9995.0
56  87       volvo     sedan  104.3  188.8  ohc  four  114  23  12940.0
57  88       volvo     wagon  104.3  188.8  ohc  four  114  23  13415.0

https://pynative.com/python-pandas-read-csv/

Get element from DataFrame

In [5]:
oo.at[3, 'company']

'audi'

Read CSV with a column header

In [45]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv', header = 3)
pd.options.display.max_rows = 20
oo

     2 alfa-romero hatchback   94.5  171.2 ohcv   six  154  19    16500
0    3        audi     sedan   99.8  176.6  ohc  four  102  24  13950.0
1    4        audi     sedan   99.4  176.6  ohc  five  115  18  17450.0
2    5        audi     sedan   99.8  177.3  ohc  five  110  19  15250.0
3    6        audi     wagon  105.8  192.7  ohc  five  110  19  18920.0
4    9         bmw     sedan  101.2  176.8  ohc  four  101  23  16430.0
..  ..         ...       ...    ...    ...  ...   ...  ...  ..      ...
53  81  volkswagen     sedan   97.3  171.7  ohc  four   85  27   7975.0
54  82  volkswagen     sedan   97.3  171.7  ohc  four   52  37   7995.0
55  86  volkswagen     sedan   97.3  171.7  ohc  four  100  26   9995.0
56  87       volvo     sedan  104.3  188.8  ohc  four  114  23  12940.0
57  88       volvo     wagon  104.3  188.8  ohc  four  114  23  13415.0

[58 rows x 10 columns]

read CSV with a multi-index column header

In [7]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv', header = [0, 1])
pd.options.display.max_rows = 20
oo

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495
0,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
1,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
2,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
3,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
4,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
...,...,...,...,...,...,...,...,...,...,...
55,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
56,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
57,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
58,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
59,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

Read CSV without a column header

In [8]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv', names = ['company_name', 'type', 'len','etype','milage', 'sunroof'])
oo.columns

Index(['company_name', 'type', 'len', 'etype', 'milage', 'sunroof'], dtype='object')

Default column header

In [9]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv', header=None, prefix='Col_')
oo.columns

Index(['Col_0', 'Col_1', 'Col_2', 'Col_3', 'Col_4', 'Col_5', 'Col_6', 'Col_7',
       'Col_8', 'Col_9'],
      dtype='object')

https://pynative.com/python-pandas-dataframe/

Dataframe from dict

In [10]:
student_dict = {'Name': ['Joe', 'Nat', 'Harry'], 'Age': [20, 21, 19], 'Marks' : [85.10, 77.80, 91.54]}
student_df = pd.DataFrame(student_dict)
student_df

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54

In [11]:
student_df.describe()

        Age      Marks
count   3.0   3.000000
mean   20.0  84.813333
std     1.0   6.874484
min    19.0  77.800000
25%    19.5  81.450000
50%    20.0  85.100000
75%    20.5  88.320000
max    21.0  91.540000

In [12]:
student_df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
student_df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [14]:
student_df.empty

False

In [15]:
student_df.shape

(3, 3)

In [16]:
student_df.size

9

In [17]:
student_df.values

array([['Joe', 20, 85.1],
       ['Nat', 21, 77.8],
       ['Harry', 19, 91.54]], dtype=object)

DataFrame selection

In [18]:
student_df.at[0, 'Name']

'Joe'

In [19]:
student_df.iat[0,0]

'Joe'

In [20]:
student_df.get('Name')

0      Joe
1      Nat
2    Harry
Name: Name, dtype: object

In [21]:
student_df.iloc[0:2, 0:2]

  Name  Age
0  Joe   20
1  Nat   21

DataFrame modification

In [24]:
student_df

    Name  Age Class  Marks
0    Joe   20     A  85.10
1    Nat   21     A  77.80
2  Harry   19     A  91.54

In [25]:
student_df.insert(loc=2, column='Class2', value='A')
student_df

    Name  Age Class2 Class  Marks
0    Joe   20      A     A  85.10
1    Nat   21      A     A  77.80
2  Harry   19      A     A  91.54

In [26]:
student_df.drop(columns='Class2')

    Name  Age Class  Marks
0    Joe   20     A  85.10
1    Nat   21     A  77.80
2  Harry   19     A  91.54

In [27]:
filter = student_df['Marks'] > 80
student_df['Marks'].where(filter, other=0, inplace=True)
student_df

    Name  Age Class2 Class  Marks
0    Joe   20      A     A  85.10
1    Nat   21      A     A   0.00
2  Harry   19      A     A  91.54

DataFrame filter columns

In the below example, we only include the column with a column label that starts with â€˜Nâ€™.

In [28]:
student_df.filter(like = 'N', axis='columns')

    Name
0    Joe
1    Nat
2  Harry

DataFrame rename columns

In [29]:
student_df.rename(columns={'Marks' : 'Percentage'})

    Name  Age Class2 Class  Percentage
0    Joe   20      A     A       85.10
1    Nat   21      A     A        0.00
2  Harry   19      A     A       91.54

DataFrame Join

In [30]:
student_dict = {'Name' : ['Joe', 'Nat'], 'Age' : [20, 21]}
student_df = pd.DataFrame(student_dict)
student_df

  Name  Age
0  Joe   20
1  Nat   21

In [32]:
marks_dict = {'Marks' : [85.10, 77.80]}
marks_df = pd.DataFrame(marks_dict)
marks_df

   Marks
0   85.1
1   77.8

In [33]:
student_df.join(marks_df)

  Name  Age  Marks
0  Joe   20   85.1
1  Nat   21   77.8

DataFrame GroupBy

In [34]:
student_dict = {'Name': ['Joe', 'Nat', 'Harry'], 'Class': ['A', 'B', 'A'], 'Marks': [85.10, 77.80, 91.54]}
student_df = pd.DataFrame(student_dict)
student_df

    Name Class  Marks
0    Joe     A  85.10
1    Nat     B  77.80
2  Harry     A  91.54

In [35]:
student_df.groupby('Class').mean()

       Marks
Class
A      88.32
B      77.80

DataFrame Iteration


DataFrame.iterrows() can loop a DataFrame row-wise. It returns the index and row of the DataFrame in each iteration of the for a loop.

In [41]:
for index, row in student_df.iterrows():
    print (index, row)

0 Name      Joe
Class       A
Marks    85.1
Name: 0, dtype: object
1 Name      Nat
Class       B
Marks    77.8
Name: 1, dtype: object
2 Name     Harry
Class        A
Marks    91.54
Name: 2, dtype: object

DataFrame Conversion

In [42]:
student_df.to_dict()

{'Name': {0: 'Joe', 1: 'Nat', 2: 'Harry'},
 'Class': {0: 'A', 1: 'B', 2: 'A'},
 'Marks': {0: 85.1, 1: 77.8, 2: 91.54}}

https://pynative.com/python-pandas-exercise/

Exercise 2: Clean the dataset and update the CSV file

Replace all column values which contain ?, n.a, or NaN.

In [56]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv')
oo.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [57]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv', na_values={'price':["?","n.a"], 'wheel-base':["?","n.a"], 'horsepower':["?","n.a"], 'length':["?","n.a"], 'average-mileage':["?","n.a"]})
oo

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

Exercise 3: Find the most expensive car company name

In [72]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv')
oo.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [73]:
oo.sort_values(by='price', ascending=False)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...,...
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

Alternative Solution

In [74]:
oo[['company', 'price']][oo.price == oo['price'].max()]

          company    price
35  mercedes-benz  45400.0

Exercise 4: Print All Toyota Cars details

In [75]:
oo[oo.company == 'toyota']

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

alternative solution

In [76]:
oo.groupby('company').get_group('toyota')

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

Exercise 5: Count total cars per company

In [4]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv')
oo.company.value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
mercedes-benz    4
mitsubishi       4
audi             4
volkswagen       4
jaguar           3
porsche          3
alfa-romero      3
chevrolet        3
isuzu            3
honda            3
dodge            2
volvo            2
Name: company, dtype: int64

Exercise 6: Find each companyâ€™s Higesht price car

In [11]:
cp = oo[['company', 'price']]
cp.groupby('company'). max()

                 price
company
alfa-romero    16500.0
audi           18920.0
bmw            41315.0
chevrolet       6575.0
dodge           6377.0
honda          12945.0
isuzu           6785.0
jaguar         36000.0
mazda          18344.0
mercedes-benz  45400.0
mitsubishi      8189.0
nissan         13499.0
porsche        37028.0
toyota         15750.0
volkswagen      9995.0
volvo          13415.0

Exercise 7: Find the average mileage of each car making company

In [8]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv')
oo.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [9]:
am = oo[['company', 'average-mileage']]
am

        company  average-mileage
0   alfa-romero               21
1   alfa-romero               21
2   alfa-romero               19
3          audi               24
4          audi               18
..          ...              ...
56   volkswagen               27
57   volkswagen               37
58   volkswagen               26
59        volvo               23
60        volvo               23

[61 rows x 2 columns]

In [10]:
am.set_index('company')

             average-mileage
company
alfa-romero               21
alfa-romero               21
alfa-romero               19
audi                      24
audi                      18
...                      ...
volkswagen                27
volkswagen                37
volkswagen                26
volvo                     23
volvo                     23

[61 rows x 1 columns]

In [12]:
am.groupby('company').mean()

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

Exercise 8: Sort all cars by Price column

In [13]:
oo = pd.read_csv('C:\\Users\\jenny\\venvs\\py39\\PYnative\\Automobile_data.csv')
oo.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [15]:
oo.sort_values(by='price', ascending=False).head(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

Exercise 9: Concatenate two data frames using the following conditions

In [16]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

In [21]:
gc = pd.DataFrame(GermanCars)
gc

    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

In [22]:
jc = pd.DataFrame(japaneseCars)
jc

       Company  Price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900

In [24]:
pd.concat([gc, jc], keys = ['Germany', 'Japan'])

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

In [25]:
pd.concat([gc, jc])

       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
0       Toyota   29995
1        Honda   23600
2       Nissan   61500
3  Mitsubishi    58900

Exercise 10: Merge two data frames using the following condition

In [26]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [29]:
cp = pd.DataFrame(Car_Price)
cp

  Company   Price
0  Toyota   23845
1   Honda   17995
2     BMV  135925
3    Audi   71400

In [31]:
ch = pd.DataFrame(car_Horsepower)
ch

  Company  horsepower
0  Toyota         141
1   Honda          80
2     BMV         182
3    Audi         160

In [35]:
pd.merge(cp, ch, on='Company')

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160